InformationRegisters/бит_НормыНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НормыНаУслуги</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаОдного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаДвоих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопНормаНаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопНормаНаКаждого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДопНормуНаОдного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДопНормуНаЛьготника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПотребленияПоКу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативОДН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособРасчетаПоУслуге</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_УслугиЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_УслугиЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаОтчетаГЦЖС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ГрафыОтчетаПоГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖСОбщеДом</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_КПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_ДПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовыеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>нвл_ИспользоватьТариф</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_ГруппаУслугДляПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ГруппыУслугДляПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_НормыНаУслуги/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выводит существующие записи регистра с отбором.
// По услуге, способу расчета, типу и статусу квартиры.
// Или выводит существующие режимы потребеления для услуги, если записей нет.
//
&НаСервере
Процедура ВывестиАктуальные (Услуга, СпособРасчета, ТипКвартиры, СтатусКвартиры)
	
	Запрос = Новый Запрос;
	
	СписокПоставщиков = Новый СписокЗначений;
	Для Каждого ТекСтрока Из Услуга.РежимыПотребленияУслуг Цикл
		СписокПоставщиков.Добавить(ТекСтрока.РежимПотребленияУслуг);
	КонецЦикла;

	Запрос.УстановитьПараметр("Дата"           ,ЭтаФорма.Запись.Период);
	Запрос.УстановитьПараметр("Услуга"         ,ЭтаФорма.Запись.Услуга);
	Запрос.УстановитьПараметр("СписокСсылок"   ,СписокПоставщиков);
	Запрос.УстановитьПараметр("СпособРасчета"  ,СпособРасчета);
	Запрос.УстановитьПараметр("ТипКвартиры"    ,ТипКвартиры);
	Запрос.УстановитьПараметр("СтатусКвартиры" ,СтатусКвартиры);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_РежимыПотребленияУслуг.Ссылка КАК РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью,
	|	бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного,
	|	бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаЛьготника,
	|	бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6,
	// БИТ_ЖКХ 10.05.2016 15:11:34 Начало правки... 
	|	бит_НормыНаУслугиСрезПоследних.НормативОДН
	// БИТ_ЖКХ 10.05.2016 15:11:36 Конец правки. 
	|ИЗ
	|	Справочник.бит_РежимыПотребленияУслуг КАК бит_РежимыПотребленияУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&Дата,
	|				Услуга = &Услуга
	|					И СпособРасчетаПоУслуге = &СпособРасчета
	|					И ТипКвартиры = &ТипКвартиры
	|					И СтатусКвартиры = &СтатусКвартиры) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО (бит_НормыНаУслугиСрезПоследних.РежимПотребления = бит_РежимыПотребленияУслуг.Ссылка)
	|ГДЕ
	|	бит_РежимыПотребленияУслуг.Ссылка В(&СписокСсылок)";
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда 

		 ЭтаФорма.ТаблицаРесурсов.Загрузить(ТаблицаЗаписей);
	КонецЕсли;
	
	ТаблицаРесурсов.Сортировать("РежимПотребления");
	Модифицированность = Ложь;
	
КонецПроцедуры // ВывестиАктуальные()

// Процедура  добавляет записи в регистр.
//
&НаСервере
Процедура ДобавитьЗапись(Период,Услуга,СпособРасчета,ТипКвартиры,СтатусКвартиры, Данные)
	
	НовЗапись                                 = РегистрыСведений.бит_НормыНаУслуги.СоздатьМенеджерЗаписи();
	НовЗапись.Период                          = Период;
	НовЗапись.Услуга                          = Услуга;
	НовЗапись.СпособРасчетаПоУслуге           = СпособРасчета;
	НовЗапись.ТипКвартиры                     = ТипКвартиры;
	НовЗапись.СтатусКвартиры                  = СтатусКвартиры;
	НовЗапись.РежимПотребления                = Данные.РежимПотребления;
	// БИТ_ЖКХ добавление кода Начало: 12.07.2011 
	НовЗапись.НормативПотребленияПоКу  		  = Данные.НормативПотребленияПоКу;
	// БИТ_ЖКХ добавление кода конец : 12.07.2011
	НовЗапись.НаОдного                        = Данные.НаОдного;
	НовЗапись.НаДвоих                         = Данные.НаДвоих;
	НовЗапись.НаСемью                         = Данные.НаСемью;
	НовЗапись.НаСемью4                        = Данные.НаСемью4;
	НовЗапись.НаСемью5                        = Данные.НаСемью5;
	НовЗапись.НаСемью6                        = Данные.НаСемью6;
	НовЗапись.НаЛицевойСчет                   = Данные.НаЛицевойСчет;
	НовЗапись.ИспользоватьДопНормуНаЛьготника = Данные.ИспользоватьДопНормуНаЛьготника;
	НовЗапись.ИспользоватьДопНормуНаОдного    = Данные.ИспользоватьДопНормуНаОдного;
	НовЗапись.ДопНормаНаКаждого               = Данные.ДопНормаНаКаждого;
	НовЗапись.ДопНормаНаСемью                 = Данные.ДопНормаНаСемью;
	// БИТ_ЖКХ 10.05.2016 15:12:07 Начало правки...
	НовЗапись.НормативОДН					  = Данные.НормативОДН;
	// БИТ_ЖКХ 10.05.2016 15:12:07 Конец правки.
	НовЗапись.Записать();
	
КонецПроцедуры // ДобавитьЗапись()

// Процедура управляет видимостью элементов формы.
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	ПравоИзменения  = ПолучитьМетаданные();

	Если НЕ ПравоИзменения Тогда
		
		Элементы.ФормаЗаписатьИЗакрыть.Доступность        = Ложь;
		Элементы.ФормаЗаписать.Доступность                = Ложь;

	Иначе
		
		Элементы.ФормаЗаписатьИЗакрыть.Доступность        = Истина;
		Элементы.ФормаЗаписать.Доступность                = Истина;
		
	КонецЕсли;
	
КонецПроцедуры	

// Функция получает данные на сервере и возвращает структуру на форму.
//
&НаСервере
Функция РегистрСведенийМенеджерЗаписи()
	
		Данные        = ЭтаФорма.Запись;
		
		Период        = ТекущаяДата();
		Услуга        = Данные.Услуга;
		СпособРасчетаПоУслуге = ?(Данные.СпособРасчетаПоУслуге = Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка()
									,Услуга.ОсновнойСпособРасчета,Данные.СпособРасчетаПоУслуге);
		ТипКвартиры = ?(Данные.ТипКвартиры = Справочники.бит_ТипыКвартиры.ПустаяСсылка()
									,Справочники.бит_ТипыКвартиры.Отдельная, Данные.ТипКвартиры);
		СтатусКвартиры = ?(Данные.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.ПустаяСсылка()
									,Справочники.бит_СтатусыКвартиры.Приватизированная, Данные.СтатусКвартиры);						
		
		ВывестиАктуальные(Услуга, СпособРасчетаПоУслуге,ТипКвартиры,СтатусКвартиры);
		
		Структура =       Новый Структура;
		Структура.Вставить("СпособРасчетаПоУслуге",СпособРасчетаПоУслуге);
		Структура.Вставить("ТипКвартиры",ТипКвартиры);
		Структура.Вставить("СтатусКвартиры",СтатусКвартиры);
		Возврат Структура;
		
КонецФункции

// Функция возвращает с сервера возможность изменения.
//
&НаСервере
Функция ПолучитьМетаданные()
Регистр = Метаданные.РегистрыСведений.бит_НормыНаУслуги;	
	
	ПравоИзменения = ПравоДоступа("Изменение", Регистр);
Возврат ПравоИзменения;	
КонецФункции	

// Процедура выбирает строки с пустыми значениями и затем их удаляет.
//
&НаСервере 
Процедура ВыбратьПустые(СтруктураОтбора) 
	 
	ВыборкаПустых =  РегистрыСведений.бит_НормыНаУслуги.Выбрать(,,СтруктураОтбора); 
	 
	Пока ВыборкаПустых.Следующий() Цикл
		ВыборкаПустых.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает с сервера "СписокСпособовРасчета".
//
&НаСервере	
Функция СписокСпособовРасчетаНаСервере(УслугаСсылка)
	
	СписокСпособовРасчета = Новый СписокЗначений;
	Для Каждого ТекСтрока Из УслугаСсылка.СпособыРасчета Цикл
		СписокСпособовРасчета.Добавить(ТекСтрока.СпособРасчета);
	КонецЦикла;
	Возврат СписокСпособовРасчета;
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Обработчик события "ПриСозданииНаСервере".
// Выводит данные на форму.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаУслугиЖКХ") Тогда
		
		Запись.Услуга   = Параметры.ЗаполнитьИзСправочникаУслугиЖКХ.Услуга;
		
	КонецЕсли;
		
КонецПроцедуры

// Обработчик события "ПриОткрытии".
// Выводит данные на форму.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Запись.Услуга = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.ПустаяСсылка") тогда
		
		Структура =		 РегистрСведенийМенеджерЗаписи();
		Запись.СпособРасчетаПоУслуге = Структура.СпособРасчетаПоУслуге;
		Запись.СтатусКвартиры = Структура.СтатусКвартиры;
		Запись.ТипКвартиры = Структура.ТипКвартиры;
		
	КонецЕсли;
	
	// БИТ_ЖКХ добавление кода. Начало: 	
	УстановитьВидимость()
	// БИТ_ЖКХ добавление кода конец

КонецПроцедуры

// Обработчик события "ПередЗаписью".
// Проверяет заполнение обязательных реквизитов.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстСообщения = "Элемент не может быть записан!";
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Запись.Услуга) Тогда
		ТекстСообщения = ТекстСообщения + " Не заполнена услуга.";
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Запись.СпособРасчетаПоУслуге) Тогда
		ТекстСообщения = ТекстСообщения + " Не заполнен способ расчета по услуге.";
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Запись.СтатусКвартиры) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнен статус квартиры.";
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Запись.ТипКвартиры) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнен тип квартиры.";
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
	КонецЕсли;	
	
КонецПроцедуры

 // Обработчик события "ПриЗаписи".
 // Записывает данные из формы в регистр.
 //
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		Для Каждого Строка из ТаблицаРесурсов Цикл
		ДобавитьЗапись(Запись.Период,Запись.Услуга,Запись.СпособРасчетаПоУслуге,Запись.ТипКвартиры,Запись.СтатусКвартиры,Строка);
	КонецЦикла;

КонецПроцедуры

// Обработчик события "ПослеЗаписи".
// Удаляются строки, с незаполненным режимом потребления.
// Возникают при стандартной записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		СтруктураОтбора = Новый Структура("РежимПотребления",ПредопределенноеЗначение("Справочник.бит_РежимыПотребленияУслуг.ПустаяСсылка"));
	
		ВыбратьПустые(СтруктураОтбора);

 КонецПроцедуры
 
 // Обработчик события "Нажатие" кнопки "ОК". 
//
&НаКлиенте
Процедура OK(Команда)
	
	ПриЗаписиНаСервере(Ложь,,);
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Обработчик события "ПриИзменении" элемента "Период".
//
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);
	
КонецПроцедуры

// Обработчик события "ПриИзменении" измерения "Услуга".
//
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)

	ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);
	
КонецПроцедуры

// Обработчик события "ПриИзменении" измерения "ТипКвартиры".
//
&НаКлиенте
Процедура ТипКвартирыПриИзменении(Элемент)
	
	ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);

КонецПроцедуры

 // Обработчик события "ПриИзменении" измерения "СтатусКвартиры"
//
&НаКлиенте
Процедура СтатусКвартирыПриИзменении(Элемент)
	
	ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);
	
КонецПроцедуры

// Обработчик события "ПриИзменении" элемента "СпособРасчета".
//
&НаКлиенте
Процедура СпособРасчетаПоУслугеПриИзменении(Элемент)
	
	ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);

КонецПроцедуры

 // Процедура - Обработчик события "НачалоВыбора" элемента.
 // СпособРасчетаПоУслуге.
 // Ограничивает выбор способа расчета в зависимости от услуги.
 //
&НаКлиенте
Процедура СпособРасчетаПоУслугеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
		СтандартнаяОбработка = Ложь;
		СписокСпособовРасчета = СписокСпособовРасчетаНаСервере(Запись.Услуга);
	ВыбранныйЭлемент = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СпособРасчетаПоУслугеНачалоВыбораЗавершение", ЭтотОбъект), СписокСпособовРасчета, Элементы.СпособРасчетаПоУслуге);

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПоУслугеНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Запись.СпособРасчетаПоУслуге = ВыбранныйЭлемент.Значение;
        
    КонецЕсли;
    
    ВывестиАктуальные(Запись.Услуга, Запись.СпособРасчетаПоУслуге, Запись.ТипКвартиры, Запись.СтатусКвартиры);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаРесурсов

// Обработчик события "ПередНачаломДобавления" элемента формы "Таблица ресурсов".
// Запрещает добавлять строки (режимы потребления), т.к. они определяются из справочника.
//
&НаКлиенте
Процедура ТаблицаРесурсовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Режимы потребления не могут быть изменены. Они определяются из справочника ""Режимы потребления услуг""");
	
КонецПроцедуры

 // Обработчик события "ПриИзменении" значения колонки "РежимПотребления" формы "Таблица ресурсов".
// Запрещает изменять режимы потребления, т.к. они определяются из справочника.
//
&НаКлиенте
Процедура ТаблицаРесурсовРежимПотребленияПриИзменении(Элемент)
	
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Режимы потребления не могут быть изменены. Они определяются из справочника ""Режимы потребления услуг""");
		
КонецПроцедуры

 // Обработчик события "ПередУдалением" элемента формы "Таблица ресурсов".
// Запрещает удалять строки (режимы потребления), т.к. они определяются из справочника.
//
&НаКлиенте
Процедура ТаблицаРесурсовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Режимы потребления не могут быть изменены. Они определяются из справочника ""Режимы потребления услуг""");
	
КонецПроцедуры

 // Обработчик события "ПриИзменении" значения колонки "НаСемью" формы "Таблица ресурсов".
// Запрещает изменять режимы потребления, т.к. они определяются из справочника.
//
&НаКлиенте
Процедура ТаблицаРесурсовНаСемьюПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРесурсов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаСемью4) Тогда
		
		ТекущаяСтрока.НаСемью4 = ТекущаяСтрока.НаСемью;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаСемью5) Тогда
		
		ТекущаяСтрока.НаСемью5 = ТекущаяСтрока.НаСемью;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаСемью6) Тогда
		
		ТекущаяСтрока.НаСемью6 = ТекущаяСтрока.НаСемью;
		
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти
